Table of Contents
 Class CutData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the cut beam
public class CutData
Inheritance
object
CutData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Direction
Direction of cut [Parallel|Perpendicular]
public CutOrientation Direction { get; set; }
Property Value
CutOrientation
 NormalVector
Plane normal. Direction of normal set remove part of beam
public Vector3D NormalVector { get; set; }
Property Value
Vector3D
 Offset
Offset - shift of cut
public double Offset { get; set; }
Property Value
double
 PlanePoint
3DPlane Point
public Point3D PlanePoint { get; set; }
Property Value
Point3D
 Edit this page